/* This is a mapping of BRError code failures to localized failure reasons */

/* kBRMediaManagerErrorNoPlayer*/
100 = "The selected content could not be played.";


/* kBRMediaPlayerNoDatabaseFound*/
200 = "Cannot find any content.";

/* kBRMediaPlayerSongPlaybackError*/
201 = "Cannot play the current song.";


/* kBRMediaNoContent*/
300 = "No content was found.";

/* kBRMediaNoPhotoContent */
301 = "There are no photos in your iPhoto library.";

/* kBRMediaNoPodcastContent */
302 = "There are no podcasts in your iTunes library.";

/* kBRMediaNotDRMAuthorized */
303 = "You are not authorized to play this content.";

/* kBRMediaNoMovieFolderContent */
304 = "There are no movies to play in your Movies folder.";

/* kBRMediaNoTVShowContent */
305 = "There are no TV shows in your iTunes library.";

/* kBRMediaNoMusicVideoContent */
306 = "There are no music videos in your iTunes library.";

/* kBRMediaNoPlaylists */
307 = "There are no playlists in your iTunes library.";

/* kBRMediaNoSongContent */
308 = "There are no songs in your iTunes library.";

/* kBRMediaNoAudioBookContent */
309 = "There are no audiobooks in your iTunes library.";

/* kBRMediaEmptyPlaylist */
310 = "There are no songs in this playlist.";

/* kBRMediaNoSuchPlaylist */
311 = "The selected playlist could not be found.";

/* kBRMediaNoSuchSong */
312 = "The selected song could not be found.";

/* kBRMediaNoMovies */
315 = "There are no movies in your Movies folder.";

/* kBRMediaNoSongForSlideshow */
316 = "The song for this slideshow could not be played.";

/* kBRMediaSongPlaybackErrorDuringSlideshow */
317 = "The song for this slideshow could not be played.";

/* kBRVideoUnplayable */
318 = "The selected video could not be played.";

/* kBRMediaRadioStreamUnplayable */
319 = "The radio stream you selected could not be played.";

/* kBRRemoteMediaNoContent*/
350 = "No content was found in this library.";

/* kBRRemoteMediaNoPhotoContent */
351 = "There are no photos in this library.";

/* kBRRemoteMediaNoPodcastContent */
352 = "There are no podcasts in this library.";

/* kBRRemoteMediaNotDRMAuthorized */
353 = "You are not authorized to play this content.";

/* kBRRemoteMediaNoTVShowContent */
355 = "There are no TV shows in this library.";

/* kBRRemoteMediaNoMusicVideoContent */
356 = "There are no music videos in this library.";

/* kBRRemoteMediaNoPlaylists */
357 = "There are no playlists in this library.";

/* kBRRemoteMediaNoSongContent */
358 = "There are no songs in this library.";

/* kBRRemoteMediaNoAudioBookContent */
359 = "There are no audiobooks in this library.";

/* kBRRemoteMediaEmptyPlaylist */
360 = "There are no songs in this playlist.";

/* kBRRemoteMediaLoadingError */
361 = "An error occurred loading this content.";

/* kBRRemotePhotoSourceUnavailableError */
363 = "The photo sharing source is unavailable.";

/* kBRDataSourceInitializationFailure*/
400 = "No content was found.";

/* kBRDataSourceURLResolutionFailure*/
410 = "No content was found.";

/* kBRDataSourceConnectionInProgressError */
420 = "Already attempting to connect to this source.";


/* KBRSystemNetworkHostUnreachable */
501 = "Cannot connect to this library.";

/* kBRSystemErrorTrailerSiteUnreachable */
502 = "The theatrical trailer cannot be played at this time.";

/* kBRSystemNotHDCPCompliant */
503 = "This content requires HDCP for playback.";

/* kBRSetupCantSetLanguage */
600 = "The language could not be changed.";


/* kBRDVDErrorCantInitializeDVDPlaybackAlert */
750 = "A DVD cannot be played at this time.";

/* kBRDVDErrorCantEjectDVDAlert */
751 = "The DVD cannot be ejected.";

/* kBRDVDErrorBadRegionCodeAlert */
752 = "The DVD region code does not match the DVD player.";

/* kBRDVDErrorBadDVDMediaAlert */
753 = "The DVD cannot be played.";

/* kBRDVDErrorFatalDVDAlert */
754 = "The DVD cannot be played.";

/* kBRCDErrorCantEjectCDAlert */
755 = "The CD cannot be ejected.";

/*	kDVDErrorAuthentification = -70025,	The user attempting to change the region code could not be authenticated. */
-70025 = "The disc's copy protection cannot be verified.";

/* kBRInternalResourceError */
900 = "An error occurred.";

